In [13]:
# Imports

import pandas as pd
import numpy as np
import pymysql

from sqlalchemy import create_engine
from getpass import getpass

In [14]:
# Create engine

password = getpass()
connection_string = 'mysql+pymysql://root:'+password+'@localhost:3306/sakila'
engine = create_engine(connection_string)

In [11]:
# 1. How many distinct (different) actors' last names are there?

query = '''SELECT 
    COUNT(DISTINCT (last_name)) AS distinct_last_names
FROM
    actor'''
data = engine.execute(query)
data = pd.DataFrame(data)
data.head()

   distinct_last_names
0                  121

In [15]:
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

query = '''
SELECT 
    *,
    MONTH(rental_date) AS rental_date_month,
    WEEKDAY(rental_date) AS rental_date_weekday,
    CASE WEEKDAY(rental_date)
        WHEN 5 & 6 THEN 'weekend'
        ELSE 'workday'
    END AS day_type,
    MONTH(return_date) AS return_date_month,
    WEEKDAY(return_date) AS return_date_weekday,
    CASE WEEKDAY(return_date)
        WHEN 5 & 6 THEN 'weekend'
        ELSE 'workday'
    END AS day_type
FROM
    sakila.rental;
'''
data = engine.execute(query)
data = pd.DataFrame(data)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_date_month,rental_date_weekday,day_type,return_date_month,return_date_weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,5,1,workday,5.0,3.0,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,5,1,workday,5.0,5.0,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,5,1,workday,6.0,2.0,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,5,1,workday,6.0,4.0,weekend
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,5,1,workday,6.0,3.0,workday

In [17]:
# 3. Get all films with ARMAGEDDON in the title.

query = '''
SELECT 
    *
FROM
    film
WHERE
    title LIKE UPPER('%%ARMAGEDDON%%');
'''
data = engine.execute(query)
data = pd.DataFrame(data)
data.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [18]:
# 4. Get 10 the longest films.

query = '''
SELECT 
    *
FROM
    film
ORDER BY length DESC
LIMIT 10;
'''
data = engine.execute(query)
data = pd.DataFrame(data)
data.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,872,SWEET BROTHERHOOD,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,None,3,2.99,185,27.99,R,Deleted Scenes,2006-02-15 05:03:42
1,609,MUSCLE BRIGHT,A Stunning Panorama of a Sumo Wrestler And a H...,2006,1,None,7,2.99,185,23.99,G,Deleted Scenes,2006-02-15 05:03:42
2,426,HOME PITY,A Touching Panorama of a Man And a Secret Agen...,2006,1,None,7,4.99,185,15.99,R,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42
3,349,GANGS PRIDE,A Taut Character Study of a Woman And a A Shar...,2006,1,None,4,2.99,185,27.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
4,141,CHICAGO NORTH,A Fateful Yarn of a Mad Cow And a Waitress who...,2006,1,None,6,4.99,185,11.99,PG-13,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

In [19]:
# 5. How many films include Behind the Scenes content?

query = '''
SELECT 
    COUNT(*) AS nb_films_with_behind_the_scenes
FROM
    film
WHERE
    special_features LIKE UPPER('%%BEHIND THE SCENES%%');
'''
data = engine.execute(query)
data = pd.DataFrame(data)
data.head()

   nb_films_with_behind_the_scenes
0                              538

In [20]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?

query = '''
SELECT 
    rating, ROUND(AVG(length), 2) AS avg_film_length
FROM
    film
GROUP BY rating
HAVING AVG(length) > 120;
'''
data = engine.execute(query)
data = pd.DataFrame(data)
data.head()

  rating avg_film_length
0  PG-13          120.44

In [22]:
# 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

query = '''
SELECT 
    title,
    length,
    CASE
        WHEN length <= 60 THEN 'Short'
        WHEN length <= 120 THEN 'Medium'
        ELSE 'Long'
    END as ranking
FROM
    film
WHERE
    length IS NOT NULL AND length != 0
ORDER BY length DESC;
'''
data = engine.execute(query)
data = pd.DataFrame(data)
data.head()

            title  length ranking
0   CHICAGO NORTH     185    Long
1  CONTROL ANTHEM     185    Long
2  DARN FORRESTER     185    Long
3     GANGS PRIDE     185    Long
4       HOME PITY     185    Long